""" головний модуль задачі
- виводить розрахункову таблицю на екран та в файл
- виводить первинні данні на екран
"""

import os
from process_data import create_analiz


MAIN_MENU = \
"""
~~~~~~~  Аналіз зміни рівня цін на продовольчі товари ~~~~~~~

1 - вивід заявок на екран
2 - запис заявок в файл
3 - вивід списка накладних
4 - вивід списка клієнтів
0 - завершення роботи
----------------------------
"""

TITLE = "АНАЛІЗ ЗМІНИ РІВНЯ ЦІН НА ПРОДОВОЛЬЧІ ТОВАРИ"

HEADER = \
"""
=========================================================================================================================
Найменування ринку | Найменування товара |  Одиниця виміру | 2007 |      2008        |      2011        |     2017      |
=========================================================================================================================
                                                                  |грн| у % до 2007  |грн| у % до 2008  |грн|у % до 2011|
=========================================================================================================================

"""

FOOTER = \
'''
==========================================================================================

'''

STOP_MESSAGE = 'Для продовження натисніть <Enter>'

def show_analiz(analiz_list):
    """виводиить таблицю заявок 

    Args:
        zajavka_list ([type]): список заявок
    """
    print(f"\n\n{TITLE:^91}")
    print(HEADER)

    for analiz in analiz_list:
        print(f"{analiz['nazva_rinku']:10}",
              f"{analiz['nazva_tovaru']:20}",
              f"{analiz['system_units']:^16}",
              f"{analiz['2007_price']:4}",
              f"{analiz['2008_price']:7}",
              f"{analiz['vidsotok_do_2007']:>7}",
              f"{analiz['2011_price']:7}",
              f"{analiz['vidsotok_do_2008']:7}",
              f"{analiz['2017_price']:7}",
              f"{analiz['vidsotok_do_2011']:7}"

              )

    print(FOOTER)
    
while True:
    
    # вивід головного меню
    os.system('clear')   
    print(MAIN_MENU)
    command_number = input("Введіть номер команди: ")
    
    # обробка команд користувача
    if command_number == '0':
        print('\nПрограма завершила роботу')
        exit(0)
        
    elif command_number == '1':
        analiz_list = create_analiz()
        show_analiz(analiz_list)
        input(STOP_MESSAGE)